app/Controllers/usuario_controler.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('Victor', 'Machado', 'Admin', 'admin@admin.com', '$2y$10$VAccaDx7vVXKqxSj7p5IAekW/968VdfAs3d9DlZHhvN0M.wrW7xy6')
---
	public function formValidation() {

		$input = $this->validate([
				'nombre' => 'required|min_length[3]',
				'apellido' => 'required|min_length[3]|max_length[25]',
				'usuario' => 'required|min_length[3]',
				'email' =>  'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
				'pass' => 'required|min_length[3]|max_length[10]',

		],
		);

		$formModel = new usuario_Model();

		if(!$input){
			$data['titulo']='Registro';
			echo view('front/head_views',$data);
			echo view('front/navbar_views');
			echo view('back/usuario/registro', ['validation' => $this->validator]);
			echo view('front/footer');
		} else{
			$formModel->save([
				'nombre' => $this->request->getVar('nombre'),
				'apellido' => $this->request->getVar('apellido'),
				'usuario' => $this->request->getVar('usuario'),
				'email' =>  $this->request->getVar('email'),
				'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT)
			]);